Revit 2027 API
IFCUserDefinedProperty(String, ElementId, String, String, IFCUserDefinedPropertyType, String) Constructor
 Constructs a new IFCUserDefinedProperty with input values. The property name. The Revit property id. The Revit property name. The data type of the property. The type of the property. The defined value data type of the table property.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCUserDefinedProperty(
	string ifcPropertyName,
	ElementId revitPropertyId,
	string revitPropertyName,
	string dataType,
	IFCUserDefinedPropertyType propertyType,
	string dataTypeDefined
)
Public Sub New (
	ifcPropertyName As String,
	revitPropertyId As ElementId,
	revitPropertyName As String,
	dataType As String,
	propertyType As IFCUserDefinedPropertyType,
	dataTypeDefined As String
)
public:
IFCUserDefinedProperty(
	String^ ifcPropertyName,
	ElementId^ revitPropertyId,
	String^ revitPropertyName,
	String^ dataType,
	IFCUserDefinedPropertyType propertyType,
	String^ dataTypeDefined
)
new :
        ifcPropertyName : string *
        revitPropertyId : ElementId *
        revitPropertyName : string *
        dataType : string *
        propertyType : IFCUserDefinedPropertyType *
        dataTypeDefined : string -> IFCUserDefinedProperty
Parameters
ifcPropertyName String
revitPropertyId ElementId
revitPropertyName String
dataType String
propertyType IFCUserDefinedPropertyType
dataTypeDefined String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCUserDefinedProperty Class
IFCUserDefinedProperty Overload
Autodesk.Revit.DB Namespace